Диаграмма прецедентов

@startuml
left to right direction
actor "Инженер - исследователь" as eRnd
actor "Инженер - технолог" as eTech

"Специалист по технологии" <|-- eRnd
"Специалист по технологии" <|-- eTech

actor "Инженер - конструктор" as eDesign
rectangle Simmax-additive {
  usecase UC1 as "Загрузка CAD моделей:
  --
  STL"
  usecase "Отправка задач на расчет" as UC2
  usecase "Вывод результатов" as UC3
  usecase UC4 as "Постановка задачи выращивания:
  --
  построение сетки, \n задание граничных условий, \n выбор стратегии спекания, \n задание толщины слоя"
  usecase UC5 as "Постановка задачи термообработки:
  --
  задание граничных условий"
  usecase "Экспорт деформированной STL модели" as UC6

}
"Специалист по технологии" --> UC1
"Специалист по технологии" --> UC2
"Специалист по технологии" --> UC3
"Специалист по технологии" --> UC4
"Специалист по технологии" --> UC5
"Специалист по технологии" --> UC6
eDesign --> UC3
eDesign --> UC6
@enduml
---
* для справок