
using Project.Interfaces.Tasks;
using Project.TaskParameters;
using Project.Tasks;
using System.Collections.Generic;

namespace PreProc.Interfaces
{
    /// <summary>
    /// Задачи для препроцессора для создания пользовательских задач
    /// </summary>
    public enum ComplexTaskType : int 
    { 
        /// <summary>
        /// ХИМИЧЕСКАЯ задача с одиночным процессом.
        /// Один тип файлов задач
        /// </summary>
        химическая,
        /// <summary>
        /// ТЕРМИЧЕСКАЯ задача с одиночным процессом.
        /// Один тип файлов задач
        /// </summary>
        термическая,
        /// <summary>
        /// МЕХАНИЧЕСКАЯ задача с одиночным процессом.
        /// Один тип файлов задач
        /// </summary>
        механическая,
        /// <summary>
        /// ТЕРМИЧЕСКО_ХИМИЧЕСКАЯ задача с комплексным процессом из термической и химической.
        /// Два тип файлов задач.
        /// Главный - термическая
        /// </summary>
        термическая_химическая,
        /// <summary>
        /// ТЕРМИЧЕСКО_МЕХАНИЧЕСКАЯ задача с комплексным процессом состоящим из термической и механической.
        /// Два тип файлов задач.
        /// Главный - термическая
        /// </summary>
        термическая_механическая
    };

    /// <summary>
    /// Тип подпроцесса для препроцессора по созданию пользовательских термических задач
    /// </summary>
    public enum ProcessType
    {
        /// <summary>
        /// Сварка (нагрев, охлаждение)
        /// </summary>
        Welding,
        /// <summary>
        /// Общий нагрев (нагрев)
        /// </summary>
        Heating,
        /// <summary>
        /// Закалка (охлаждение)
        /// </summary>
        Quenching,
        /// <summary>
        /// Отпуск, отжиг, старение (выдержка)
        /// </summary>
        Tempering
    }
    /// <summary>
    /// IPreProc
    /// </summary>
    public interface IPreProc
    {
        /// <summary>
        /// Препроцессор по обработке данных пользователя в команды в формате .tsf-файлов и CompData.
        /// Актуален для процессов указанных в  "ProcessType".
        /// Для сварки:
        /// - Реализована поддержка многопроходной сварки с последовательно идущими проходами и с интервалами между ними
        /// - Среда сварки должна быть задана
        /// - Нагрев от источника сварки должен быть задан
        /// - Закрепления должны быть заданы
        /// - Среда и нагрев не должны выходить за время действия материала
        /// - Создается всегда четное кол-во tsf файлов-инструкций. 
        /// - На каждый временной интервал по паре тепловой и механической задачи соответственно.
        /// Для ТО:
        /// - Требования теже, что и в сварке кроме требований нагрева
        /// - Общая тепловая и механическая задачи также поддерживаются
        /// </summary>
        /// <param name="data">список входных данных ValuableData</param>
        /// <param name="processType">тип задачи</param>>
        /// <param name="path">путь папки сохранения расчетных файлов данных</param>>
        /// <returns>список расчитанных данных CompData</returns>
        void CalcCompDataV1(List<IValuableData> data, ProcessType processType, string path);

        /// <summary>
        /// Препроцессор по обработке данных пользователя в команды в формате .tsf-файлов и CompData.
        /// Актуален для процессов указанных в  "ProcessType".
        /// Для сварки:
        /// - Реализована поддержка многопроходной сварки с последовательно идущими проходами и с интервалами между ними
        /// - Среда сварки должна быть задана
        /// - Нагрев от источника сварки должен быть задан
        /// - Закрепления должны быть заданы
        /// - Среда и нагрев не должны выходить за время действия материала
        /// - Создается всегда четное кол-во tsf файлов-инструкций. 
        /// - На каждый временной интервал по паре тепловой и механической задачи соответственно.
        /// Для ТО:
        /// - Требования теже, что и в сварке кроме требований нагрева
        /// - Общая тепловая и механическая задачи также поддерживаются
        /// </summary>
        /// <param name="data">список входных данных ValuableData</param>
        /// <param name="prop">Свойства задачи для подготовки файлов препроессором. Состоит из главной задачи и подзадачи, для создания и параметризации файлов</param>
        /// <param name="path">путь папки сохранения расчетных файлов данных</param>>
        /// <returns>список расчитанных данных CompData в виде файлов *.stf</returns>
        void CalcCompDataV2(List<IValuableData> data, ProcessProperty prop, string path);

        /// <summary>
        /// SortCompDataByTimeAndType
        /// </summary>
        /// <param name="dataStrs"></param>
        /// <returns>
        /// Отсортированный по названиям и по времени действия список задач
        /// </returns>
        List<string> SortCompDataByTimeAndType(string[] dataStrs);

        /// <summary>
        /// SetDraftParameters
        /// </summary>
        /// <typeparam name="ResultParam"></typeparam>
        /// <param name="parameter"></param>>
        void SetDraftParameters<ResultParam>(ResultParam parameter)
            where ResultParam : GeneralParameters, new();
    }
}
