SetFactory("OpenCASCADE");

Box(1) = {0, 0, 0, 1, 1, 1};
Box(2) = {1, 0, 0, 1, 1, 1};

p() = PointsOf{ Volume{1, 2}; };
MeshSize{p()} = 0.2;
//Команда Rectangle задает прямоугольник, в фигурных скобках задаются параметры: первые три параметра отвечают за координаты левого нижнего угла
//4 - параметр за ширину, 5 за длину, 6 параметр (если задан) отвечает за радиус скруглений углов
Rectangle(17) = {0.4, 0.7, 0.2, 0.3, 0.3, 0};
Rectangle(18) = {-0.2, 0.3, 0.5, 0.3, 0.3, 0};
Rectangle(19) = {0.8, -0.2, 0.5, 0.3, 0.3, 0};
Rectangle(20) = {0.3, 0.3, 0.5, 0.3, 0.3, 0};

//Команда BooleanFragments - вычисляет пересечение геометрических сущностей указанных в первых фигурных скобках, 
//с геометрическими сущностями, указанными вторыми скобками, специальный параметр Delete указывает стоит ли удалять результат пересечения (общая область у обеих групп) 
//у указанной группы геометрических сущностей. В результате перечения образуются дополнительные геометрические точки и кривые, поверхность в результате пересечения может
//быть разбита на несколько частей
b() = BooleanFragments{ Volume{1, 2}; Delete; }{ Surface{17:20}; Delete; };

p() = PointsOf{ Surface{b({2:7})}; };
MeshSize{p()} = 0.04;
