DefineConstant[ N = {4, Name "Number of elements per edge"} ];

// example of a purely hexahedral mesh using transfinite constraints and/or
// extrusion
//Команда Point - создает геометрическую точку, в скобках указывается идентификатор точки, в фигурных скобках первые три координаты x,y,z позиция в мировых координатах, 
//в качестве 4 координаты может быть указана координата характеристической длины (по умолчанию значение 1), которая интерполируется между элементами сетки
//при генерации сетки
Point(1) = {-2,0,0};
Point(2) = {-1,0,0};
Point(3) = {-1,1,0};
Point(4) = {-2,1,0};
Point(5) = {-2,0,1};
Point(6) = {-1,0,1};
Point(7) = {-1,1,1};
Point(8) = {-2,1,1};
//Команда Line - создает геометрическую кривую, в скобках указывается идентифкатор кривой, в фигурных скобках указывают два идентификатора геометрической точки
Line(1) = {4,3};
Line(2) = {3,2};
Line(3) = {2,1};
Line(4) = {1,4};
Line(6) = {5,6};
Line(7) = {6,7};
Line(8) = {7,8};
Line(9) = {8,5};
Line(10) = {1,5};
Line(11) = {4,8};
Line(12) = {2,6};
Line(13) = {3,7};
//Команда Curve Loop строит ориентированную петлю из кривых, в скобках указывается идентификатор цикла, в фигурных скобках указывается идентифкаторы кривых,
//порядок идентифкаторов кривых важен поскольку должно соблюдаться условие замкнутости контура.
//Рассмотрим цикл {3, 4, 1, 2}
//Кривая 3 {2, 1}
//Кривая 4 {1, 4}
//Кривая 1 {4, 3}
//Кривая 2 {3, 2}
//Если присмотреться к каждому набору идентификаторов, то последняя точка в идентифкаторе повторяет первую в следующем наборе,
//В итоге получается следующий набор точек 2,1 1,4 4,3 3,2 - последняя точка повторяется с первой образуя замкнутый контур
Curve Loop(14) = {3,4,1,2};
//Plane Surface - команда создает плоскую поверхность, в скобках указывается идентификатор поверхности, 
//в фигурных скобках указывается идентификатор замкнутой петли кривых
Plane Surface(15) = {14};
Curve Loop(16) = {6,7,8,9};
Plane Surface(17) = {16};
//В команде Surface Loop могут быть указаны идентификаторы кривых с отрицательным знаком, это означает что внутри идентификатора кривой нужно рассматривать точки
//в обратном порядке
//Рассмотрим цикл {10,-9,-11,-4}
//Кривая 10 {1, 5}
//Кривая -9 {5, 8} - меняем точки местами
//Кривая -11 {8, 4} - меняем точки местами
//Кривая -4 {4, 1} - меняем точки местами
//В итоге получается следующий набор точек 1,5 5,8 8,4 4,1 - условия замкнутого контура соблюдены
Curve Loop(18) = {10,-9,-11,-4};
Plane Surface(19) = {18};
Curve Loop(20) = {8,-11,1,13};
Plane Surface(21) = {20};
Curve Loop(22) = {12,7,-13,2};
Plane Surface(23) = {22};
Curve Loop(24) = {6,-12,3,10};
Plane Surface(25) = {24};
//Команда Surface Loop используется для формирования петли поверхностей, поверхности должны образовывать замкнутый контур объема, 
//отрицательный знак говорит Gmsh, что поверхность будет обратно ориентирована(обход по часовой стрелки). В скобках указывается идентификатор петли поверхностей
Surface Loop(1) = {17,-25,-23,-21,19,15};
//Команда Volume формирует объем из заданной петли поверхностей, в круглых скобках указывается идентификатор объема, в фигурных скобках идентификатор петли поверхностей
Volume(1) = {1};
/*
By hand:
Transfinite Curve{1:4,6:13} = N+1;
Transfinite Surface {15} = {1,2,3,4};
Transfinite Surface {17} = {5,6,7,8};
Transfinite Surface {19} = {1,5,8,4};
Transfinite Surface {21} = {4,8,7,3};
Transfinite Surface {23} = {2,6,7,3};
Transfinite Surface {25} = {1,5,6,2};
Transfinite Volume{1} = {1,2,3,4,5,6,7,8};

Or automatically:
*/
//Команда Transfinite Curve задает трансфиницию кривых, в фигурных скобках указывается идентификаторы кривых, или диапазон, в случае наличия одного лишь знака двоеточия
//выбираются все кривые, после знака равно указывается количество точек на кривой, остальные настройки можно найти в документации gmsh
Transfinite Curve {:} = N+1;
//Команда Transfinite Surface задает трансфиницию поверхностей, при генерации сетка получается равномерная, 
//в фигурных скобках указывается идентификаторы поверхностей, диапазон или все идентификаторы. 
//Для применения этой команды все кривые лежащие друг напротив друга должны содержать одинаковое число точек
Transfinite Surface {:};
//Команда Transfinite Volume задает трансфиницию объемов, в фигурных скобках указываются трансфинитные поверхности, диапазон или все поверхности с указанными идентификаторами,
//после применения команды gmsh пытается построить равномерную сетку из объемных элементов
Transfinite Volume {:};
//Команда Recombine Surface пытается построить преимущественно квадратные элементы сетки, для этого должно быть выполенено условия создания транфинитных поверхностей,
//в фигурных скобках указываются идентификаторы поверхностей диапазон или все идентификаторы.
Recombine Surface {:};

// the same by extruding a transfinite surface mesh

Point(51) = {0,0,0};
Point(52) = {1,0,0};
Point(53) = {1,1,0};
Point(54) = {0,1,0};
Line(51) = {54,53};
Line(52) = {53,52};
Line(53) = {52,51};
Line(54) = {51,54};
Curve Loop(55) = {52,53,54,51};
Plane Surface(56) = {55};
Transfinite Curve{51:54} = N+1;
Transfinite Surface{56} = {51,52,53,54};
Recombine Surface{56};
Extrude {0,0,1} {
  Surface{56}; Layers{N}; Recombine;
}

// and the same by using only extrusions

Point(100) = {2,0,0};
l[] = Extrude {1,0,0}{
  Point{100}; Layers{N};
};
s[] = Extrude {0,1,0}{
  Curve{l[1]}; Layers{N}; Recombine;
};
Extrude {0,0,1}{
  Surface{s[1]}; Layers{N}; Recombine;
}

// add some labels
If(!PostProcessing.NbViews)
View "Mesh Info" {
  T3(-1.5,1.5,0.5,66574){ "Pure Transfinite" };
  T3(0.5,1.5,0.5,66574){ "Extruded Transfinite" };
  T3(2.5,1.5,0.5,66574){ "Pure Extruded" };
};
EndIf
